In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from pandas import Series, DataFrame

In [2]:
from numpy.random import randint
dices = randint(1,7,(5,2))
diceroll = DataFrame(dices, columns=['dice1','dice2'])
diceroll

   dice1  dice2
0      2      3
1      1      4
2      3      4
3      5      6
4      3      2

In [3]:
diceroll['dice1']

0    2
1    1
2    3
3    5
4    3
Name: dice1, dtype: int64

In [4]:
diceroll.dice1

0    2
1    1
2    3
3    5
4    3
Name: dice1, dtype: int64

In [5]:
data = {'City': ['Tokyo','Osaka','Nagoya','Okinawa'],
                 'Temperature': [25.0,28.2,27.3,30.9],
                 'Humidity': [44,42,np.nan,62]}
cities = DataFrame(data)
cities

      City  Humidity  Temperature
0    Tokyo      44.0         25.0
1    Osaka      42.0         28.2
2   Nagoya       NaN         27.3
3  Okinawa      62.0         30.9

In [6]:
cities[['City', 'Humidity']]

      City  Humidity
0    Tokyo      44.0
1    Osaka      42.0
2   Nagoya       NaN
3  Okinawa      62.0

In [7]:
cities[['City']]

      City
0    Tokyo
1    Osaka
2   Nagoya
3  Okinawa

In [8]:
cities['City']

0      Tokyo
1      Osaka
2     Nagoya
3    Okinawa
Name: City, dtype: object

In [9]:
cities[0:2]

    City  Humidity  Temperature
0  Tokyo      44.0         25.0
1  Osaka      42.0         28.2

In [10]:
cities[2:3]

     City  Humidity  Temperature
2  Nagoya       NaN         27.3

In [11]:
cities[1:]

      City  Humidity  Temperature
1    Osaka      42.0         28.2
2   Nagoya       NaN         27.3
3  Okinawa      62.0         30.9

In [12]:
cities[cities['Temperature']>28]

      City  Humidity  Temperature
1    Osaka      42.0         28.2
3  Okinawa      62.0         30.9

In [13]:
cities

      City  Humidity  Temperature
0    Tokyo      44.0         25.0
1    Osaka      42.0         28.2
2   Nagoya       NaN         27.3
3  Okinawa      62.0         30.9

In [14]:
cities.ix[1:3, ['City','Humidity']]

      City  Humidity
1    Osaka      42.0
2   Nagoya       NaN
3  Okinawa      62.0

In [15]:
cities

      City  Humidity  Temperature
0    Tokyo      44.0         25.0
1    Osaka      42.0         28.2
2   Nagoya       NaN         27.3
3  Okinawa      62.0         30.9

In [16]:
for index, line in cities.iterrows():
    print 'Index:', index
    print line, '\n'

Index: 0
City           Tokyo
Humidity          44
Temperature       25
Name: 0, dtype: object

Index: 1
City           Osaka
Humidity          42
Temperature     28.2
Name: 1, dtype: object

Index: 2
City           Nagoya
Humidity          NaN
Temperature      27.3
Name: 2, dtype: object

Index: 3
City           Okinawa
Humidity            62
Temperature       30.9
Name: 3, dtype: object

In [17]:
humidity = cities['Humidity'].copy()
humidity[2] = 50
humidity

0    44.0
1    42.0
2    50.0
3    62.0
Name: Humidity, dtype: float64

In [18]:
cities

      City  Humidity  Temperature
0    Tokyo      44.0         25.0
1    Osaka      42.0         28.2
2   Nagoya       NaN         27.3
3  Okinawa      62.0         30.9

In [19]:
cities.loc[2,'Humidity'] = 50
cities

      City  Humidity  Temperature
0    Tokyo      44.0         25.0
1    Osaka      42.0         28.2
2   Nagoya      50.0         27.3
3  Okinawa      62.0         30.9

In [20]:
for index, line in cities.iterrows():
    if line['Temperature'] > 30:
        cities.loc[index, 'Temperature'] = 30
cities

      City  Humidity  Temperature
0    Tokyo      44.0         25.0
1    Osaka      42.0         28.2
2   Nagoya      50.0         27.3
3  Okinawa      62.0         30.0